InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпоративныйАккаунт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Софт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Софт</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Софт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квалификация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омФайлы/Ext/Module.bsl
Функция ПолучитьПутьКФайлуПДМ(Объект, Проект = Неопределено, НаименованиКомплекта = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Если ТипОбъекта = Тип("СправочникСсылка.ИзделияКомплект") Тогда
	
		ПутьКФайлу = ПолучитьПутьКФайлуКомплект(Объект, Проект, НаименованиКомплекта);	
	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ГабаритныеЧертежи") Тогда
	
		ПутьКФайлу = ПолучитьПутьКФайлуГабаритныеЧертежи(Объект, Проект);
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Композиции") Тогда
	
		ПутьКФайлу = ПолучитьПутьКФайлуКомпозиции(Объект, Проект, НаименованиКомплекта);
	
	КонецЕсли; 
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
	
		Возврат ПутьКФайлу;	
	
	КонецЕсли;
	
	ОбъектОбщиеНастройки = Отчеты.ОбщиеНастройки.Создать();
	
	ИмяНастройкиКореньПДМ = ОбъектОбщиеНастройки.ПолучитьИмяПутьККорневойПапкеPDM();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПроекта.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
	|ГДЕ
	|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
	|	И НастройкиПроекта.НомерНастройки = 0
	|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ИмяНастройкиКореньПДМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КореньПДМ = "";
	
	Пока Выборка.Следующий() Цикл
		
		КореньПДМ = Выборка.Значение; 
		
	КонецЦикла;
	
	КонтрольЗнакаРазделителяПапок(КореньПДМ);
	
	Возврат КореньПДМ + ПутьКФайлу;
	

КонецФункции // ПолучитьПутьКФайлу(Объект)

Функция ПолучитьПутьКФайлуКомпозиции(Композиция, Проект, НаименованиКомплекта)

	Если ЗначениеЗаполнено(Проект) И ЗначениеЗаполнено(НаименованиКомплекта) Тогда
	
		стПути = омПроектыСерверПовтор.ПолучитьПутьКИменамПапокПроекта(Проект);
		КонтрольЗнакаРазделителяПапок(стПути.ИмяКорневойПапкиВPDM);
		КонтрольЗнакаРазделителяПапок(стПути.ИмяПапкиКомпозицииВPDM);
		
		Возврат стПути.ИмяКорневойПапкиВPDM + стПути.ИмяПапкиКомпозицииВPDM + СокрЛП(НаименованиКомплекта);	
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Композиции.Проект.ИмяПапкиКомпозицииВPDM КАК ПроектИмяПапкиКомпозицииВPDM,
		|	Композиции.Наименование КАК Наименование,
		|	Композиции.Проект.ИмяКорневойПапкиВPDM КАК ПроектИмяКорневойПапкиВPDM
		|ИЗ
		|	Справочник.Композиции КАК Композиции
		|ГДЕ
		|	Композиции.Ссылка = &Ссылка
		|	И НЕ Композиции.Проект.ИмяПапкиКомпозицииВPDM = """"";
	
	Запрос.УстановитьПараметр("Ссылка", Композиция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПутьКФайлу = "";
	
	Пока Выборка.Следующий() Цикл 
		НаименованиКомплекта = Выборка.Наименование;
		ПутьКФайлу = Выборка.ПроектИмяКорневойПапкиВPDM;
		КонтрольЗнакаРазделителяПапок(ПутьКФайлу);
		ПроектИмяПапкиКомпозицииВPDM = ПутьКФайлу + Выборка.ПроектИмяПапкиКомпозицииВPDM;
		КонтрольЗнакаРазделителяПапок(ПроектИмяПапкиКомпозицииВPDM);
		ПутьКФайлу = ПроектИмяПапкиКомпозицииВPDM + СокрЛП(НаименованиКомплекта);	
	КонецЦикла;
	
	Возврат ПутьКФайлу;
	
КонецФункции // ПолучитьПутьКФайлуКомплект(Объект) 

Функция ПолучитьПутьКФайлуГабаритныеЧертежи(ГЧ, Проект)

	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Проект) Тогда
		
		стПути = омПроектыСерверПовтор.ПолучитьПутьКИменамПапокПроекта(Проект);
		КонтрольЗнакаРазделителяПапок(стПути.ИмяКорневойПапкиВPDM);
		
		Возврат стПути.ИмяКорневойПапкиВPDM + СокрЛП(стПути.ИмяПапкиГЧВPDM);	
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Проект.ИмяПапкиГЧВPDM КАК ПроектИмяПапкиГЧВPDM
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ГЧ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПутьКФайлу = "";
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ПустаяСтрока(Выборка.ПроектИмяПапкиГЧВPDM) Тогда
			
			ПутьКФайлу = Выборка.ПроектИмяПапкиГЧВPDM;	
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПутьКФайлу;
	
КонецФункции // ПолучитьПутьКФайлуКомплект(Объект) 

Функция ПолучитьПутьКФайлуКомплект(Комплект, Проект, НаименованиКомплекта)

	ПутьКФайлу = "";
	
	Если ЗначениеЗаполнено(Проект) И ЗначениеЗаполнено(НаименованиКомплекта) Тогда
	
		ПроектИмяКорневойПапкиВPDM = омПроектыСерверПовтор.ПолучитьПутьКИменамПапокПроекта(Проект).ИмяКорневойПапкиВPDM;
		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИзделияКомплект.Наименование КАК Наименование,
			|	ИзделияКомплект.Проект.ИмяКорневойПапкиВPDM КАК ПроектИмяКорневойПапкиВPDM
			|ИЗ
			|	Справочник.ИзделияКомплект КАК ИзделияКомплект
			|ГДЕ
			|	ИзделияКомплект.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Комплект);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ПроектИмяКорневойПапкиВPDM 	= Выборка.ПроектИмяКорневойПапкиВPDM;
			НаименованиКомплекта 				= Выборка.Наименование;
			
		КонецЦикла;
	КонецЕсли;
	
		
		Если НЕ (ПустаяСтрока(ПроектИмяКорневойПапкиВPDM) ИЛИ ПустаяСтрока(НаименованиКомплекта)) Тогда
			
			ПроектИмяКорневойПапкиВPDM = ПроектИмяКорневойПапкиВPDM;
			
			КонтрольЗнакаРазделителяПапок(ПроектИмяКорневойПапкиВPDM);
			
			ПутьКФайлу = ПроектИмяКорневойПапкиВPDM + СокрЛП(НаименованиКомплекта);	
		
		КонецЕсли;
		
	
	Возврат ПутьКФайлу;
	
КонецФункции // ПолучитьПутьКФайлуКомплект(Объект) 

Процедура КонтрольЗнакаРазделителяПапок(ПутьКФайлу)

	ПутьКФайлу = СокрЛП(ПутьКФайлу);
	
	Если НЕ Прав(ПутьКФайлу, 1) = "\" Тогда
		
		ПутьКФайлу = ПутьКФайлу + "\";	
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМаксимальныйРазмерФайла() Экспорт

	Возврат РаботаСФайлами.МаксимальныйРазмерФайлаОбщий();	

КонецФункции // ПолучитьМаксимальныйРазмерФайла()

Функция ПолучитьПутьКФайлуТЗ(Объект, Проект = Неопределено, НаименованиКомплекта = Неопределено, ПолучитьФайл = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипОбъекта = ТипЗнч(Объект);
	ПутьКФайлуТЗ = "";
	
	Если ТипОбъекта = Тип("СправочникСсылка.ИзделияКомплект") Тогда
	
		ПутьКФайлуТЗ = ПолучитьПутьКФайлуКомплектТЗ(Объект, Проект, НаименованиКомплекта);	
	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Композиции") Тогда
	
		ПутьКФайлуТЗ = ПолучитьПутьКФайлуКомпозиции(Объект, Проект, НаименованиКомплекта);
		
	Иначе

		Возврат ПутьКФайлуТЗ;
	
	КонецЕсли; 
	
	Если ПустаяСтрока(ПутьКФайлуТЗ) Тогда
	
		Возврат ПутьКФайлуТЗ;	
	
	КонецЕсли;
	
	ОбъектОбщиеНастройки = Отчеты.ОбщиеНастройки.Создать();
	
	ИмяНастройкиКореньПДМ = ОбъектОбщиеНастройки.ПолучитьИмяПутьККорневойПапкеPDM();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПроекта.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
	|ГДЕ
	|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
	|	И НастройкиПроекта.НомерНастройки = 0
	|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ИмяНастройкиКореньПДМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КореньПДМ = "";
	
	Пока Выборка.Следующий() Цикл
		
		КореньПДМ = Выборка.Значение; 
		
	КонецЦикла;
	
	КонтрольЗнакаРазделителяПапок(КореньПДМ); 
	
	ПутьКФайлуТЗ = КореньПДМ + ПутьКФайлуТЗ;
	
	КонтрольЗнакаРазделителяПапок(ПутьКФайлуТЗ);
	
	Если ПолучитьФайл Тогда
		
		ПутьКФайлуТЗ = ПутьКФайлуТЗ + НаименованиКомплекта + ".ТЗ.pdf";
		
	КонецЕсли;
	
	Возврат ПутьКФайлуТЗ;
	
КонецФункции // ПолучитьПутьКФайлу(Объект)

 
Функция ПолучитьПутьКФайлуКомплектТЗ(Комплект, Проект, НаименованиКомплекта)

	ПутьКФайлу = ПолучитьПутьКФайлуКомплект(Комплект, Проект, НаименованиКомплекта);
	
	КонтрольЗнакаРазделителяПапок(ПутьКФайлу);	
	
	Возврат ПутьКФайлу + "01.ТЗ";
	
КонецФункции // ПолучитьПутьКФайлуКомплект(Объект)
